views/compras/uploads/xml/33311_540.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:ws="http://ws.ingresomanifestacion.manifestacion.www.ventanillaunica.gob.mx"
  xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
  <soapenv:Header>
    <wsse:Security
      xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <wsse:UsernameToken
        xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
        <wsse:Username>AAL0409235E6</wsse:Username>
        <wsse:Password
          Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Z6fFB+bqbvqb6yPgstFf0gUYvQx8cAYFzHE2i9cHSWmIiGfgaD3GfyGDHWt9dBxp</wsse:Password>
      </wsse:UsernameToken>
      <wsu:Timestamp wsu:Id="Timestamp-5c9f0ef0-ab45-421d-a633-4c4fad26d945">
        <wsu:Created>2021-03-30T23:02:00Z</wsu:Created>
        <wsu:Expires>2021-03-30T23:59:59Z</wsu:Expires>
      </wsu:Timestamp>
    </wsse:Security>
  </soapenv:Header>
  <soapenv:Body>
    <ws:registroManifestacion>
      <!--Optional: -->
      <informacionManifestacion>
        <firmaElectronica>
          <certificado>MIIFTDCCBDSgAwIBAgIUMjAwMDEwMDAwMDAxMDAwMDE4MTUwDQYJKoZIhvcNAQEFBQAwggFvMRgw
            FgYDVQQDDA9BLkMuIGRlIHBydWViYXMxLzAtBgNVBAoMJlNlcnZpY2lvIGRlIEFkbWluaXN0cmFj
            acOzbiBUcmlidXRhcmlhMTgwNgYDVQQLDC9BZG1pbmlzdHJhY2nDs24gZGUgU2VndXJpZGFkIGRl
            IGxhIEluZm9ybWFjacOzbjEpMCcGCSqGSIb3DQEJARYaYXNpc25ldEBwcnVlYmFzLnNhdC5nb2Iu
            bXgxJjAkBgNVBAkMHUF2LiBIaWRhbGdvIDc3LCBDb2wuIEd1ZXJyZXJvMQ4wDAYDVQQRDAUwNjMw
            MDELMAkGA1UEBhMCTVgxGTAXBgNVBAgMEERpc3RyaXRvIEZlZGVyYWwxEjAQBgNVBAcMCUNveW9h
            Y8OhbjEVMBMGA1UELRMMU0FUOTcwNzAxTk4zMTIwMAYJKoZIhvcNAQkCDCNSZXNwb25zYWJsZTog
            SMOpY3RvciBPcm5lbGFzIEFyY2lnYTAeFw0xMDEyMjQxOTA1NTlaFw0xMzAzMjMxOTA1NTlaMIHG
            MSQwIgYDVQQDExtBR1JJQ09MQSBBTFBFIFMgREUgUkwgREUgQ1YxJDAiBgNVBCkTG0FHUklDT0xB
            IEFMUEUgUyBERSBSTCBERSBDVjEkMCIGA1UEChMbQUdSSUNPTEEgQUxQRSBTIERFIFJMIERFIENW
            MQswCQYDVQQGEwJNWDElMCMGA1UELRMcQUFMMDQwOTIzNUU2IC8gQlVSSTY5MDEyOFRWMDEeMBwG
            A1UEBRMVIC8gQlVSSTY5MDEyOEhERk5NRzA1MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQC/
            T5OIWfoQnYsMacvTIUbC7Lc0SkaFLs7w2gyvJGp3kGB5e+fxjF3uwdkgsBWBw6GPOs7TYbXNvMrN
            2wO8DIPhTu/K0klAqr/ofSD4GBMuuafcsVymcFEeSQHshVo7vruDuRrl7viHL77bVpGLPNqkYn2m
            CYvyEB/O/51muTjYIQIDAQABo4IBCDCCAQQwDAYDVR0TAQH/BAIwADALBgNVHQ8EBAMCA9gwEQYJ
            YIZIAYb4QgEBBAQDAgWgMB0GA1UdDgQWBBS0nGHAfbh87ltfURaINqtBbvxbXDAuBgNVHR8EJzAl
            MCOgIaAfhh1odHRwOi8vcGtpLnNhdC5nb2IubXgvc2F0LmNybDAzBggrBgEFBQcBAQQnMCUwIwYI
            KwYBBQUHMAGGF2h0dHA6Ly9vY3NwLnNhdC5nb2IubXgvMB8GA1UdIwQYMBaAFOtZfQQimlONnnEa
            oFiWKfU54KDFMBAGA1UdIAQJMAcwBQYDKgMEMB0GA1UdJQQWMBQGCCsGAQUFBwMEBggrBgEFBQcD
            AjANBgkqhkiG9w0BAQUFAAOCAQEAwNsi5H5mxDhGX/1w67YxvGg6XegxjHx9VMyF0DVHUrBGsXb5
            1t1Y4FSjqKGFiw64cLNIFl1N1MnQHAXYg1G87zWpFmod6fcrBIMb0zgu3suU940hgS+hc6b+VJXz
            LrFT6yKmmW+hFA7Dbof23OUTMw7juxiiACOUSvJ2j08izBlrJFsr5sYrztLbIh7eXoaRg02psRfy
            /pBeQGe4IvErPhPDtTW5CqFdE5LOBVD1bcYyrJVGOAG1y77+zsW3IKf/V2uxgONJPXE6LpW/JwDp
            DdwsEBgOl4WK2vu7yoZH0LWPFpMuRg3hW4dTxbMu+6x+VrCDpx4ijT1WHSa3JLpFOg==</certificado>
          <cadenaOriginal>|AAL0409235E6|AAL970927390|AFC000526BJ2|ASA060425JV0|1|043613006EQH1|0170200EXZDU3|0170200EXZDR8|COVE2000034Z1|PEDIMENTO|PATENTE|020|PEDIMENTOX1|PATENTEX1|060|10/08/2020|1000.0|FORPAG.CC|otra forma de pago 1|04/09/2019|595023.54|PENDIENTE DE PAGO|FORPAG.OT|otra forma de pago 2|05/08/2019|124789.29|PENDIENTE SU PAGO EN TIEMPO|FORPAG.CH|01/01/2020|MOTIVO|MERCANCIA|FORPAG.LC|VALADU.VPV|INCRE.CE|10/08/2020|100.0|1|INCRE.CG|01/01/2020|10000.0|0|INCRE.GS|12/02/2020|45100.05|1|INCRE.GT|13/03/2019|672100.31|0|INCRE.HM|14/06/2019|984100.46|1|INCRE.MC|15/05/2019|2564223.05|0|INCRE.MP|16/04/2019|9564123.48|1|INCRE.RD|17/03/2019|155123.09|0|INCRE.TI|18/02/2019|456333.07|1|INCRE.VC|19/01/2019|84654.16|0|DECRE.GR|10/08/2020|200.0|DECRE.GT|11/07/2020|1200.0|DECRE.ID|12/06/2020|21200.2|DECRE.PI|13/05/2020|621200.15|DECRE.RC|14/04/2020|7621200.99|DECRE.RP|15/03/2020|9621200.55|COVE12004TH16|10/08/2020|28000.8|POR PAGAR|FORPAG.EF|VALADU.VMS|INCRE.CE|10/08/2020|6500.0|1|INCRE.TI|18/05/2019|56987.99|0|DECRE.PI|10/08/2020|200.0|58100.51|952200.13|76500.35|635008.41|354100.28|</cadenaOriginal>
          <firma>Equa2Y7Ir5di9B/OkifnAnS6Pe8BmoZ4fMerDTJWessmD0497IcnrrnAnq7J2G0LBlt0w3wUJOb8BB9XkwqLeZHymecSrqc8cZ7cEl+VcXCMPl0sr7vaSiXi0gcELt/XlPSb4wsiTVzh1d5pkzZJViewpsEUfeIvyi22sOLXiss=</firma>
        </firmaElectronica>
        <importador-exportador>
          <rfc>AAL0409235E6</rfc>
        </importador-exportador>
        <datosManifestacionValor>
          <personaConsulta>
            <rfc>AAL970927390</rfc>
          </personaConsulta>
          <personaConsulta>
            <rfc>AFC000526BJ2</rfc>
          </personaConsulta>
          <personaConsulta>
            <rfc>ASA060425JV0</rfc>
          </personaConsulta>
          <existeVinculacion>1</existeVinculacion>
          <!--Optional: -->
          <documentos>
            <!--Optional: -->
            <eDocument>043613006EQH1</eDocument><!--String -->
          </documentos>
          <documentos>
            <!--Optional: -->
            <eDocument>0170200EXZDU3</eDocument><!--String -->
          </documentos>
          <documentos>
            <!--Optional: -->
            <eDocument>0170200EXZDR8</eDocument><!--String -->
          </documentos>
          <!--1 or more repetitions: -->
          <informacionCove>
            <cove>COVE2000034Z1</cove>
            <!--Zero or more repetitions: -->
            <pedimento>
              <!--Optional: -->
              <pedimento>PEDIMENTO</pedimento>
              <!--Optional: -->
              <patente>PATENTE</patente>
              <!--Optional: -->
              <aduana>020</aduana>
            </pedimento>
            <pedimento>
              <!--Optional: -->
              <pedimento>PEDIMENTOX1</pedimento>
              <!--Optional: -->
              <patente>PATENTEX1</patente>
              <!--Optional: -->
              <aduana>060</aduana>
            </pedimento>
            <!--1 or more repetitions: -->
            <precioPagado>
              <fechaPago>2020-08-10T09:00:00Z</fechaPago>
              <total>1000.0</total>
              <tipoPago>FORPAG.CC</tipoPago>
              <especifique>otra forma de pago 1</especifique>
            </precioPagado>
            <!--1 or more repetitions: -->
            <precioPorPagar>
              <fechaPago>2019-09-04T13:10:58Z</fechaPago>
              <total>595023.54</total>
              <situacionNofechaPago>PENDIENTE DE PAGO</situacionNofechaPago>
              <tipoPago>FORPAG.OT</tipoPago>
              <especifique>otra forma de pago 2</especifique>
            </precioPorPagar>
            <precioPorPagar>
              <fechaPago>2019-08-05T14:20:23Z</fechaPago>
              <total>124789.29</total>
              <situacionNofechaPago>PENDIENTE SU PAGO EN TIEMPO</situacionNofechaPago>
              <tipoPago>FORPAG.CH</tipoPago>
            </precioPorPagar>
            <!--1 or more repetitions: -->
            <compensoPago>
              <fecha>2020-01-01T10:10:32Z</fecha>
              <motivo>MOTIVO</motivo>
              <prestacionMercancia>MERCANCIA</prestacionMercancia>
              <tipoPago>FORPAG.LC</tipoPago>
            </compensoPago>
            <metodoValoracion>VALADU.VPV</metodoValoracion>
            <!--1 or more repetitions: -->
            <incrementables>
              <tipoIncrementable>INCRE.CE</tipoIncrementable>
              <fechaErogacion>2020-08-10T23:59:59Z</fechaErogacion>
              <importe>100.0</importe>
              <aCargoImportador>1</aCargoImportador>
            </incrementables>
            <incrementables>
              <tipoIncrementable>INCRE.CG</tipoIncrementable>
              <fechaErogacion>2020-01-01T09:05:10Z</fechaErogacion>
              <importe>10000.0</importe>
              <aCargoImportador>0</aCargoImportador>
            </incrementables>
            <incrementables>
              <tipoIncrementable>INCRE.GS</tipoIncrementable>
              <fechaErogacion>2020-02-12T10:25:40Z</fechaErogacion>
              <importe>45100.05</importe>
              <aCargoImportador>1</aCargoImportador>
            </incrementables>
            <incrementables>
              <tipoIncrementable>INCRE.GT</tipoIncrementable>
              <fechaErogacion>2019-03-13T11:30:45Z</fechaErogacion>
              <importe>672100.31</importe>
              <aCargoImportador>0</aCargoImportador>
            </incrementables>
            <incrementables>
              <tipoIncrementable>INCRE.HM</tipoIncrementable>
              <fechaErogacion>2019-06-14T12:35:50Z</fechaErogacion>
              <importe>984100.46</importe>
              <aCargoImportador>1</aCargoImportador>
            </incrementables>
            <incrementables>
              <tipoIncrementable>INCRE.MC</tipoIncrementable>
              <fechaErogacion>2019-05-15T13:10:22Z</fechaErogacion>
              <importe>2564223.05</importe>
              <aCargoImportador>0</aCargoImportador>
            </incrementables>
            <incrementables>
              <tipoIncrementable>INCRE.MP</tipoIncrementable>
              <fechaErogacion>2019-04-16T14:32:20Z</fechaErogacion>
              <importe>9564123.48</importe>
              <aCargoImportador>1</aCargoImportador>
            </incrementables>
            <incrementables>
              <tipoIncrementable>INCRE.RD</tipoIncrementable>
              <fechaErogacion>2019-03-17T15:41:29Z</fechaErogacion>
              <importe>155123.09</importe>
              <aCargoImportador>0</aCargoImportador>
            </incrementables>
            <incrementables>
              <tipoIncrementable>INCRE.TI</tipoIncrementable>
              <fechaErogacion>2019-02-18T16:01:11Z</fechaErogacion>
              <importe>456333.07</importe>
              <aCargoImportador>1</aCargoImportador>
            </incrementables>
            <incrementables>
              <tipoIncrementable>INCRE.VC</tipoIncrementable>
              <fechaErogacion>2019-01-19T10:14:25Z</fechaErogacion>
              <importe>84654.16</importe>
              <aCargoImportador>0</aCargoImportador>
            </incrementables>
            <!--1 or more repetitions: -->
            <decrementables>
              <tipoDecrementable>DECRE.GR</tipoDecrementable>
              <fechaErogacion>2020-08-10T23:59:59Z</fechaErogacion>
              <importe>200.0</importe>
            </decrementables>
            <decrementables>
              <tipoDecrementable>DECRE.GT</tipoDecrementable>
              <fechaErogacion>2020-07-11T10:20:21Z</fechaErogacion>
              <importe>1200.0</importe>
            </decrementables>
            <decrementables>
              <tipoDecrementable>DECRE.ID</tipoDecrementable>
              <fechaErogacion>2020-06-12T11:45:08Z</fechaErogacion>
              <importe>21200.2</importe>
            </decrementables>
            <decrementables>
              <tipoDecrementable>DECRE.PI</tipoDecrementable>
              <fechaErogacion>2020-05-13T12:30:23Z</fechaErogacion>
              <importe>621200.15</importe>
            </decrementables>
            <decrementables>
              <tipoDecrementable>DECRE.RC</tipoDecrementable>
              <fechaErogacion>2020-04-14T13:19:51Z</fechaErogacion>
              <importe>7621200.99</importe>
            </decrementables>
            <decrementables>
              <tipoDecrementable>DECRE.RP</tipoDecrementable>
              <fechaErogacion>2020-03-15T14:35:23Z</fechaErogacion>
              <importe>9621200.55</importe>
            </decrementables>
          </informacionCove>
          <informacionCove>
            <cove>COVE12004TH16</cove>
            <!--Zero or more repetitions: -->
            <precioPorPagar>
              <fechaPago>2020-08-10T23:59:59Z</fechaPago>
              <total>28000.8</total>
              <situacionNofechaPago>POR PAGAR</situacionNofechaPago>
              <tipoPago>FORPAG.EF</tipoPago>
            </precioPorPagar>
            <!--1 or more repetitions: -->
            <metodoValoracion>VALADU.VMS</metodoValoracion>
            <!--1 or more repetitions: -->
            <incrementables>
              <tipoIncrementable>INCRE.CE</tipoIncrementable>
              <fechaErogacion>2020-08-10T23:59:59Z</fechaErogacion>
              <importe>6500.0</importe>
              <aCargoImportador>1</aCargoImportador>
            </incrementables>
            <incrementables>
              <tipoIncrementable>INCRE.TI</tipoIncrementable>
              <fechaErogacion>2019-05-18T15:54:12Z</fechaErogacion>
              <importe>56987.99</importe>
              <aCargoImportador>0</aCargoImportador>
            </incrementables>
            <!--1 or more repetitions: -->
            <decrementables>
              <tipoDecrementable>DECRE.PI</tipoDecrementable>
              <fechaErogacion>2020-08-10T23:59:59Z</fechaErogacion>
              <importe>200.0</importe>
            </decrementables>
          </informacionCove>
          <valorEnAduana>
            <totalPrecioPagado>58100.51</totalPrecioPagado>
            <totalPrecioPorPagar>952200.13</totalPrecioPorPagar>
            <totalIncrementables>76500.35</totalIncrementables>
            <totalDecrementables>635008.41</totalDecrementables>
            <totalValorAduana>354100.28</totalValorAduana>
          </valorEnAduana>
        </datosManifestacionValor>
      </informacionManifestacion>
    </ws:registroManifestacion>
  </soapenv:Body>
</soapenv:Envelope>